FKDD_COPY_DIFF_3_2026-02-14/AccumulationRegisters/Планирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Планирование</Name>
			<Comment>Регистр накопления Планирование</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоказательПлана1</Name>
					<Comment>Показатель плана 1</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказательПлана2</Name>
					<Comment>Показатель плана 2</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказательПлана3</Name>
					<Comment>Показатель плана 3</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказательФакта1</Name>
					<Comment>Показатель факта 1</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказательФакта2</Name>
					<Comment>Показатель факта 2</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказательФакта3</Name>
					<Comment>Показатель факта 3</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала планирования</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Comment>Дата окончания планирования</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидПлана</Name>
					<Comment>Вид плана</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПлановКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАналитикиПланирования1</Name>
					<Comment>Вид аналитики планирования 1</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.АналитическиеРазрезыПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАналитикиПланирования2</Name>
					<Comment>Вид аналитики планирования 2</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.АналитическиеРазрезыПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был зафиксирован факт продажи товара</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Documents/ПланФакт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПланФакт</Name>
			<Comment>План / факт</Comment>
			<BasedOn>
				<xr:Item>Document.ПланФакт</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
				<xr:Item>AccumulationRegister.Планирование</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор документа - пользователь, породивший документ.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Идентификатор юридического лица от которого выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлана</Name>
					<Comment>Вид плана</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПлановКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектПланирования</Name>
					<Comment>Объект планирования</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.АналитическиеРазрезыПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала планирования</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Comment>Дата окончания планирования</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ-основание</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланФакт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к документу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Comment>Дата создания</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОперации</Name>
					<Comment>Дата операции</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
					<Comment>Показатели</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидАналитикиПланирования1</Name>
							<Comment>Вид аналитики планирования 1</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АналитическиеРазрезыПланирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидАналитикиПланирования2</Name>
							<Comment>Вид аналитики планирования 2</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АналитическиеРазрезыПланирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательПлана1</Name>
							<Comment>Показатель плана 1</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательПлана2</Name>
							<Comment>Показатель плана 2</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательПлана3</Name>
							<Comment>Показатель плана 3</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыПлана</Name>
					<Comment>Параметры плана</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПараметра</Name>
							<Comment>Вид параметра</Comment>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Comment>Значение параметра</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ПараметрыПланирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/AccumulationRegisters/Планирование/Ext/RecordSetModule.bsl
Перем Дата Экспорт, 
ДокументОбъект Экспорт, 
ВидПлана Экспорт, 
ДатаНачала Экспорт, 
ДатаКонца Экспорт,
ПодразделениеКомпании Экспорт;

// Возвращает результат запроса по ТЧ "Показатели"
Функция ПолучитьТаблицуПоказатели()
	Запрос=Новый Запрос();
	ТекстЗапроса="
	|ВЫБРАТЬ
	|	ДокументПоказатели.ВидАналитикиПланирования1 КАК ВидАналитикиПланирования1,
	|	ДокументПоказатели.ВидАналитикиПланирования2 КАК ВидАналитикиПланирования2,
	|	ДокументПоказатели.ПоказательПлана1 КАК ПланФакт1,
	|	ДокументПоказатели.ПоказательПлана2 КАК ПланФакт2,
	|	ДокументПоказатели.ПоказательПлана3 КАК ПланФакт3				
	|ИЗ
	|	Документ.ПланФакт.Показатели КАК ДокументПоказатели
	|ГДЕ
	|	ДокументПоказатели.Ссылка=&Ссылка	
	|";
	
	Запрос.УстановитьПараметр("Ссылка",ДокументОбъект.Ссылка);
	Запрос.Текст=ТекстЗапроса;
	Возврат Запрос.Выполнить().Выгрузить();		
КонецФункции

// Проведение по регистрам документа с видом операции "План"
Процедура План() Экспорт
	ТЧПоказатели=ПолучитьТаблицуПоказатели();
	
	Для Каждого Показатель Из ТЧПоказатели Цикл
		НовоеДвижение=Добавить();
		
		// Стандартные атрибуты
		//НовоеДвижение.ВидДвижения=ВидДвиженияНакопления.Приход;
		НовоеДвижение.Период=Дата;
		НовоеДвижение.Регистратор=ДокументОбъект;
		
		// Атрибуты шапки
		НовоеДвижение.ВидПлана=ВидПлана;
		НовоеДвижение.ДатаНачала=ДатаНачала;
		НовоеДвижение.ДатаКонца=ДатаКонца;
		НовоеДвижение.ПодразделениеКомпании=ПодразделениеКомпании;
		
		// Атрибуты ТЧ "Показатели"
		НовоеДвижение.ВидАналитикиПланирования1=Показатель.ВидАналитикиПланирования1;
		НовоеДвижение.ВидАналитикиПланирования2=Показатель.ВидАналитикиПланирования2;
		НовоеДвижение.ПоказательПлана1=Показатель.ПланФакт1;
		НовоеДвижение.ПоказательПлана2=Показатель.ПланФакт2;
		НовоеДвижение.ПоказательПлана3=Показатель.ПланФакт3;
	КонецЦикла;
	
	// убиваем циклическую ссылку
	ДокументОбъект=Неопределено;
КонецПроцедуры

// Проведение по регистрам документа с видом операции "Факт"
Процедура Факт() Экспорт
	
	ТЧПоказатели=ПолучитьТаблицуПоказатели();
	
	Для Каждого Показатель Из ТЧПоказатели Цикл
		НовоеДвижение=Добавить();
		
		// Стандартные атрибуты
		//НовоеДвижение.ВидДвижения=ВидДвиженияНакопления.Приход;
		НовоеДвижение.Период=Дата;
		НовоеДвижение.Регистратор=ДокументОбъект;
		
		// Атрибуты шапки
		НовоеДвижение.ВидПлана=ВидПлана;
		НовоеДвижение.ДатаНачала=ДатаНачала;
		НовоеДвижение.ДатаКонца=ДатаКонца;
		НовоеДвижение.ПодразделениеКомпании=ПодразделениеКомпании;
		
		// Атрибуты ТЧ "Показатели"
		НовоеДвижение.ВидАналитикиПланирования1=Показатель.ВидАналитикиПланирования1;
		НовоеДвижение.ВидАналитикиПланирования2=Показатель.ВидАналитикиПланирования2;
		НовоеДвижение.ПоказательФакта1=Показатель.ПланФакт1;
		НовоеДвижение.ПоказательФакта2=Показатель.ПланФакт2;
		НовоеДвижение.ПоказательФакта3=Показатель.ПланФакт3;
	КонецЦикла;
	
	// убиваем циклическую ссылку
	ДокументОбъект=Неопределено;
КонецПроцедуры

// Предопределенная процедура
Процедура ПриЗаписи(Отказ, Замещение)
	
	// Зарегистрируем изменения для узлов РБД
	орРегистрацияИзменений(ЭтотОбъект);
	
КонецПроцедуры	//	ПриЗаписи()
